testing/artillery/artillery-local.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    timeout: 30          # seconds
    pool: 100            # enable keep-alive / reuse sockets
    maxSockets: 256
  phases:
    # Extended warm-up so sandbox RPC can stabilise
    - duration: 60
      arrivalRate: 5
      rampTo: 13
      name: "Extended Warm-up"

    # Gradual ramp towards the configured target TPS
    - duration: 120
      arrivalRate: 13
      rampTo: 27
      name: "Ramp to Target"

    # Sustained load at TARGET for validation
    - duration: 120
      arrivalRate: 27
      name: "Sustained Load"

  variables:
    receiverId:
      - "user1.test.near"
      - "user2.test.near"
      - "user3.test.near"
      - "alice.test.near"
      - "bob.test.near"

    amount:
      - "1000000000000000000000000"    # 1 token
      - "5000000000000000000000000"    # 5 tokens
      - "10000000000000000000000000"   # 10 tokens

scenarios:
  - name: "Batched FT Transfers"
    weight: 50
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            transfers:
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Batch load test A"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Batch load test B"
          expect:
            - statusCode: [200, 400, 500]

  - name: "Single FT Transfer"
    weight: 40
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            receiverId: "{{ receiverId }}"
            amount: "{{ amount }}"
            memo: "Load test {{ $timestamp }}"
          expect:
            - statusCode: [200, 400, 500]

  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200