testing/artillery/benchmark-sandbox-10m.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    timeout: 30
    pool: 120
    maxSockets: 300
  phases:
    # Gentle warm-up before the sustained benchmark window
    - duration: 10
      arrivalRate: 10
      rampTo: 60
      name: "Extended Warm-up"

    # Gradual ramp to benchmark target to avoid nonce storms
    - duration: 20
      arrivalRate: 25
      rampTo: 100
      name: "Ramp to 100 TPS"

    # Sustained benchmark requirement: 100 TPS for 10 minutes (600 seconds)
    - duration: 500
      arrivalRate: 100
      name: "Sustained 100 TPS"

  variables:
    receiverId:
      - "user1.test.near"
      - "user2.test.near"
      - "user3.test.near"
      - "alice.test.near"
      - "bob.test.near"

    amount:
      - "1000000000000000000000000"   # 1 token
      - "5000000000000000000000000"   # 5 tokens
      - "10000000000000000000000000"  # 10 tokens

scenarios:
  - name: "Batched FT Transfers"
    weight: 80
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            transfers:
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Benchmark batch A"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Benchmark batch B"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Benchmark batch C"
          expect:
            - statusCode: 200

  - name: "Single FT Transfer"
    weight: 15
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            receiverId: "{{ receiverId }}"
            amount: "{{ amount }}"
            memo: "Benchmark 100 TPS - {{ $timestamp }}"
          expect:
            - statusCode: 200

  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200