testing/artillery/benchmark-sandbox-300tps.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    timeout: 70
    pool: 500
    maxSockets: 2000
  phases:
    # Quick warm-up: 20s to 100 TPS
    - duration: 20
      arrivalRate: 20
      rampTo: 100
      name: "Warm-up"

    # Ramp to target: 30s to 300 TPS
    - duration: 30
      arrivalRate: 100
      rampTo: 300
      name: "Ramp to 300 TPS"

    # SUSTAINED: 10 minutes @ 300 TPS (180,000 transfers!)
    - duration: 600
      arrivalRate: 300
      name: "Sustained 300 TPS"

    # Cool-down
    - duration: 20
      arrivalRate: 300
      rampTo: 50
      name: "Cool-down"

  variables:
    receiverId:
      - "user1.test.near"
      - "user2.test.near"
      - "user3.test.near"
      - "alice.test.near"
      - "bob.test.near"
    
    amount:
      - "1000000000000000000000000"

scenarios:
  # Pure transfer load (no health checks during high load)
  - name: "FT Transfer"
    weight: 100
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            receiverId: "{{ receiverId }}"
            amount: "{{ amount }}"
            memo: "300 TPS test"
          expect:
            - statusCode: 200
            - json:
                success: true