testing/artillery/benchmark-sandbox-smoke.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    timeout: 40
    pool: 80
    maxSockets: 150
  phases:
    # Quick warm-up to prime connections and receiver caches
    - duration: 10
      arrivalRate: 5
      rampTo: 15
      name: "Warm-up"

    # Moderate ramp to expose issues around 40 TPS without overwhelming the pool
    - duration: 30
      arrivalRate: 15
      rampTo: 45
      name: "Ramp"

    # Short sustain window to validate stability at target throughput (~40 TPS)
    - duration: 45
      arrivalRate: 45
      name: "Sustain"

  variables:
    receiverId:
      - "user1.test.near"
      - "user2.test.near"
      - "user3.test.near"
      - "alice.test.near"
      - "bob.test.near"

    amount:
      - "1000000000000000000000000"   # 1 token
      - "5000000000000000000000000"   # 5 tokens
      - "10000000000000000000000000"  # 10 tokens

scenarios:
  - name: "Batched FT Transfers"
    weight: 60
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            transfers:
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Smoke batch A"
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Smoke batch B"
          expect:
            - statusCode: 200
            - json:
                success: true

  - name: "Single FT Transfer"
    weight: 30
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            receiverId: "{{ receiverId }}"
            amount: "{{ amount }}"
            memo: "Artillery smoke - {{ $timestamp }}"
          expect:
            - statusCode: 200
            - json:
                success: true

  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200