testing/artillery/benchmark-testnet.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    timeout: 115          
    pool: 200            
    maxSockets: 600      
  phases:
    # EXACTLY 10 MINUTES TOTAL (600 seconds)
    
    # Quick warm-up: 30s
    - duration: 30
      arrivalRate: 4
      rampTo: 20
      name: "Warm-up (0-30s)"
    
    # Ramp to target: 30s
    - duration: 30
      arrivalRate: 20
      rampTo: 50
      name: "Ramp to 50 TPS (30-60s)"
    
    # SUSTAINED LOAD: 500 seconds @ 50 TPS
    - duration: 400
      arrivalRate: 50
      name: "Sustained 50 TPS"
  
  variables:
    receiverId:
      - "posma-badge.testnet"  # Use receiver we know works!
    
    amount:
      - "1000000000000000000000000"   # 1 token
      - "5000000000000000000000000"   # 5 tokens
      - "10000000000000000000000000"  # 10 tokens

scenarios:
  - name: "Send FT Token"
    weight: 80
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            receiverId: "{{ receiverId }}"
            amount: "{{ amount }}"
            memo: "Artillery load test - {{ $timestamp }}"
          expect:
            - statusCode: 200
            - json:
                success: true

  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "Batch Transfer"
    weight: 10
    flow:
      - post:
          url: "/send-ft"
          headers:
            Content-Type: "application/json"
          json:
            transfers:
              - receiverId: "{{ receiverId }}"
                amount: "{{ amount }}"
                memo: "Batch test"
              - receiverId: "user1.test.near"
                amount: "1000000000000000000000000"
                memo: "Batch test 2"
          expect:
            - statusCode: 200
            - json:
                success: true